latex/preamble/margins.org
#+title: margins
#+options: num:nil ^:nil creator:nil author:nil timestamp:nil

#+BEGIN_SRC tex
  % TERSE
  \usepackage[vmargin=20mm,hmargin=25mm]{geometry}

  % VERBOSE
  % Adjust margins manually, via numerous length variables:
  % \setlength{\oddsidemargin}{-0.4mm} % 25 mm left margin
  % \setlength{\evensidemargin}{\oddsidemargin}
  % \setlength{\textwidth}{160mm}      % 25 mm right margin
  % \setlength{\topmargin}{-5.4mm}     % 20 mm top margin
  % \setlength{\headheight}{5mm} 
  % \setlength{\headsep}{5mm}
  % \setlength{\footskip}{10mm} 
  % \setlength{\textheight}{237mm}     % 20 mm bottom margin

  % IMPERIAL
  %%\setlength{\oddsidemargin}{0in}
  %\setlength{\evensidemargin}{-0.0in}
  %%\setlength{\textwidth}{6.25in}
  %\setlength{\textheight}{8.5in}
  %\setlength{\topmargin}{0.15\baselineskip}
#+END_SRC

* defaults. A4 page.

1 inch = 72pt

#+BEGIN_EXAMPLE
  |    |                     | pt    |
  |----+---------------------+-------|
  |  1 | one inch + \hoffset |       |
  |  2 | one inch + \voffset |       |
  |  3 | \oddsidemargin      | 46pt  |
  |  4 | \topmargin          | 18pt  |
  |  5 | \headheight         | 12pt  |
  |  6 | \headsep            | 25pt  |
  |  7 | \textheight         | 595pt |
  |  8 | \textwidth          | 360pt |
  |  9 | \marginparsep       | 10pt  |
  | 10 | \marginparwidth     | 50pt  |
  | 11 | \footskip           | 30pt  |
  |    | \marginparpush      | 5pt   |
  |    | \hoffset            | 0pt   |
  |    | \voffset            | 0pt   |
  |    | \paperwidth         | 597pt |
  |    | \paperheight        | 845pt |
#+END_EXAMPLE

[[file:../latex.html][back]]
