latex/preamble/margins.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>margins</title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="content">
<h1 class="title">margins</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org1930239">defaults. A4 page.</a></li>
</ul>
</div>
</div>
<div class="org-src-container">
<pre class="src src-tex"><span style="color: #b22222;">% </span><span style="color: #b22222;">TERSE</span>
<span style="color: #a020f0;">\usepackage</span>[<span style="color: #a0522d;">vmargin=20mm,hmargin=25mm</span>]{<span style="color: #0000ff;">geometry</span>}

<span style="color: #b22222;">% </span><span style="color: #b22222;">VERBOSE</span>
<span style="color: #b22222;">% </span><span style="color: #b22222;">Adjust margins manually, via numerous length variables:</span>
<span style="color: #b22222;">% </span><span style="color: #b22222;">\setlength</span><span style="color: #b22222;">{</span><span style="color: #b22222;">\oddsidemargin</span><span style="color: #b22222;">}{-0.4mm} % 25 mm left margin</span>
<span style="color: #b22222;">% </span><span style="color: #b22222;">\setlength</span><span style="color: #b22222;">{</span><span style="color: #b22222;">\evensidemargin</span><span style="color: #b22222;">}{</span><span style="color: #b22222;">\oddsidemargin</span><span style="color: #b22222;">}</span>
<span style="color: #b22222;">% </span><span style="color: #b22222;">\setlength</span><span style="color: #b22222;">{</span><span style="color: #b22222;">\textwidth</span><span style="color: #b22222;">}{160mm}      % 25 mm right margin</span>
<span style="color: #b22222;">% </span><span style="color: #b22222;">\setlength</span><span style="color: #b22222;">{</span><span style="color: #b22222;">\topmargin</span><span style="color: #b22222;">}{-5.4mm}     % 20 mm top margin</span>
<span style="color: #b22222;">% </span><span style="color: #b22222;">\setlength</span><span style="color: #b22222;">{</span><span style="color: #b22222;">\headheight</span><span style="color: #b22222;">}{5mm} </span>
<span style="color: #b22222;">% </span><span style="color: #b22222;">\setlength</span><span style="color: #b22222;">{</span><span style="color: #b22222;">\headsep</span><span style="color: #b22222;">}{5mm}</span>
<span style="color: #b22222;">% </span><span style="color: #b22222;">\setlength</span><span style="color: #b22222;">{</span><span style="color: #b22222;">\footskip</span><span style="color: #b22222;">}{10mm} </span>
<span style="color: #b22222;">% </span><span style="color: #b22222;">\setlength</span><span style="color: #b22222;">{</span><span style="color: #b22222;">\textheight</span><span style="color: #b22222;">}{237mm}     % 20 mm bottom margin</span>

<span style="color: #b22222;">% </span><span style="color: #b22222;">IMPERIAL</span>
<span style="color: #b22222;">%%</span><span style="color: #b22222;">\setlength</span><span style="color: #b22222;">{</span><span style="color: #b22222;">\oddsidemargin</span><span style="color: #b22222;">}{0in}</span>
<span style="color: #b22222;">%</span><span style="color: #b22222;">\setlength</span><span style="color: #b22222;">{</span><span style="color: #b22222;">\evensidemargin</span><span style="color: #b22222;">}{-0.0in}</span>
<span style="color: #b22222;">%%</span><span style="color: #b22222;">\setlength</span><span style="color: #b22222;">{</span><span style="color: #b22222;">\textwidth</span><span style="color: #b22222;">}{6.25in}</span>
<span style="color: #b22222;">%</span><span style="color: #b22222;">\setlength</span><span style="color: #b22222;">{</span><span style="color: #b22222;">\textheight</span><span style="color: #b22222;">}{8.5in}</span>
<span style="color: #b22222;">%</span><span style="color: #b22222;">\setlength</span><span style="color: #b22222;">{</span><span style="color: #b22222;">\topmargin</span><span style="color: #b22222;">}{0.15</span><span style="color: #b22222;">\baselineskip</span><span style="color: #b22222;">}</span>
</pre>
</div>

<div id="outline-container-org1930239" class="outline-2">
<h2 id="org1930239">defaults. A4 page.</h2>
<div class="outline-text-2" id="text-org1930239">
<p>
1 inch = 72pt
</p>

<pre class="example">
|    |                     | pt    |
|----+---------------------+-------|
|  1 | one inch + \hoffset |       |
|  2 | one inch + \voffset |       |
|  3 | \oddsidemargin      | 46pt  |
|  4 | \topmargin          | 18pt  |
|  5 | \headheight         | 12pt  |
|  6 | \headsep            | 25pt  |
|  7 | \textheight         | 595pt |
|  8 | \textwidth          | 360pt |
|  9 | \marginparsep       | 10pt  |
| 10 | \marginparwidth     | 50pt  |
| 11 | \footskip           | 30pt  |
|    | \marginparpush      | 5pt   |
|    | \hoffset            | 0pt   |
|    | \voffset            | 0pt   |
|    | \paperwidth         | 597pt |
|    | \paperheight        | 845pt |
</pre>

<p>
<a href="../latex.html">back</a>
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="validation"></p>
</div>
</body>
</html>
